# PerformanceAdviserRuleId Class

---
The unique identifier of a PerformanceAdviserRule
SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBPerformanceAdviserRuleId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class PerformanceAdviserRuleId : GuidEnum

    Public Class PerformanceAdviserRuleId
    	Inherits GuidEnum

    public ref class PerformanceAdviserRuleId : public GuidEnum

    type PerformanceAdviserRuleId =
        class
            inherit GuidEnum
        end
The PerformanceAdviserRuleId type exposes the following members.
| Name| Description
---|---|---
| PerformanceAdviserRuleId| Creates a new PerformanceAdviserRuleId instance.
Top
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
| Name| Description
---|---|---
| Equals|  Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum)
| GetHashCode|  Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(PerformanceAdviserRuleId, PerformanceAdviserRuleId)| Compares two PerformanceAdviserRuleId instances.
| Inequality(PerformanceAdviserRuleId, PerformanceAdviserRuleId)| Compares two PerformanceAdviserRuleId instances.
Top
Each performance adviser rule registered in application must be given a unique id that can be used to identify and unregister rule later.
#### Reference
Autodesk.Revit.DB Namespace